<!-- add-pr-comment:common_plan -->

# production/common Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # module.guardduty_malware_s3[0].aws_cloudwatch_metric_alarm.malware_completed_scan_bytes[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "malware_completed_scan_bytes" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "Scanned more than 2 GB in 1 day."
      + alarm_name                            = "MalwareS3-ScanBytes-notification-canada-ca-production-document-download-scan-files"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CompletedScanBytes"
      + namespace                             = "AWS/GuardDuty/MalwareProtection"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-ok",
        ]
      + period                                = 86400
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 2147483648
      + treat_missing_data                    = "notBreaching"
    }
  # module.guardduty_malware_s3[0].aws_cloudwatch_metric_alarm.malware_completed_scan_count[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "malware_completed_scan_count" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "Scanned more than 20000 objects in 1 day."
      + alarm_name                            = "MalwareS3-ScanCount-notification-canada-ca-production-document-download-scan-files"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CompletedScanCount"
      + namespace                             = "AWS/GuardDuty/MalwareProtection"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-ok",
        ]
      + period                                = 86400
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 20000
      + treat_missing_data                    = "notBreaching"
    }
  # module.guardduty_malware_s3[0].aws_guardduty_malware_protection_plan.this will be created
  + resource "aws_guardduty_malware_protection_plan" "this" {
      + actions    = [
          + {
              + tagging = [
                  + {
                      + status = "ENABLED"
                    },
                ]
            },
        ]
      + arn        = (known after apply)
      + created_at = (known after apply)
      + id         = (known after apply)
      + region     = "ca-central-1"
      + role       = (known after apply)
      + status     = (known after apply)
      + tags       = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all   = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + protected_resource {
          + s3_bucket {
              + bucket_name     = "notification-canada-ca-production-document-download-scan-files"
              + object_prefixes = (known after apply)
            }
        }
    }
  # module.guardduty_malware_s3[0].aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "MalwareS3-notification-canada-ca-production-document-download-sc"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObjectVersionTagging",
                          + "s3:PutObjectTagging",
                          + "s3:PutObject",
                          + "s3:PutBucketNotification",
                          + "s3:ListBucket",
                          + "s3:GetObjectVersionTagging",
                          + "s3:GetObjectVersion",
                          + "s3:GetObjectTagging",
                          + "s3:GetObject",
                          + "s3:GetBucketNotification",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::notification-canada-ca-production-document-download-scan-files/*",
                          + "arn:aws:s3:::notification-canada-ca-production-document-download-scan-files",
                        ]
                    },
                  + {
                      + Action    = [
                          + "events:RemoveTargets",
                          + "events:PutTargets",
                          + "events:PutRule",
                          + "events:DeleteRule",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "events:ManagedBy" = "malware-protection-plan.guardduty.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:events:ca-central-1:296255494825:rule/DO-NOT-DELETE-AmazonGuardDutyMalwareProtectionS3*"
                    },
                  + {
                      + Action   = [
                          + "events:ListTargetsByRule",
                          + "events:DescribeRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:events:ca-central-1:296255494825:rule/DO-NOT-DELETE-AmazonGuardDutyMalwareProtectionS3*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
    }
  # module.guardduty_malware_s3[0].aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "malware-protection-plan.guardduty.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "MalwareS3-notification-canada-ca-production-document-download-sc"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
      + inline_policy (known after apply)
    }
  # module.guardduty_malware_s3[0].aws_iam_role_policy_attachment.this will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "MalwareS3-notification-canada-ca-production-document-download-sc"
    }
Plan: 6 to add, 0 to change, 0 to destroy.

# --- End of Plan 1 ---

```